import React from 'react';

const Agreement = () => {
  return (
    <div className=" ">
      <div className="fwb">第一章 概述</div>
      <div className="fwb">第一条 【规则目的】</div>
      <p>
        为了让用户享受到更优质、安全、可信赖的商业环境和交易体验，推动线上线下一体化的协同治理，优化火品平台【包括但不限于火品平台小程序）等网站及客户端】生态体系，特制定本规则总则。
      </p>
      <div className="fwb">第二条 【规则基础】</div>
      <p>
        （一）【法律基础】《中华人民共和国电子商务法》、《中华人民共和国网络安全法》、《中华人民共和国消费者权益保护法》、《网络交易管理办法》等国家法律法规及相关规范性文件（以下简称“法律规定”）规定了火品平台生态体系各方的法定权利义务，是火品平台规则制定、修订的法律基础。
        <br />
        （二）【规范基础】火品平台相关协议作为火品与其会员明确权利义务的法律文件，是火品平台规则的规范基础。
        <br />
        （三）【理念基础】火品平台生态体系各方践行商业道德和社会责任，在火品平台上共生共赢、共治共建，自律规范发展，对法律未有明确规定的，平台通过有益探索不断实现各方利益最大化，是火品平台规则的理念基础。
        <br />
      </p>
      <div className="fwb">第三条 【规则原则】</div>
      <p>
        火品平台生态体系各方尊重和信守以下原则：平等、自愿、公平、诚信。火品平台生态体系各方在火品平台上的行为不得违反法律规定，不得违背公序良俗。
      </p>
      <div className="fwb">第四条 【适用对象】</div>
      <p>
        火品平台规则适用于火品平台生态体系各方，包括用户、会员、买家、卖家、其他相关者、火品等。
      </p>
      <div className="fwb">第五条 【规则体系及效力】</div>
      火品平台规则体系及效力级别如下：
      <br />
      （一）【规则体系】火品平台规则是以下规则的统称：
      <div className="pl30">
        1.《火品平台规则总则》（以下简称“《总则》”）；
        <br />
        2.针对火品平台会员市场管理与违规处理、行业市场管理、营销活动和其他必要事项，所制定的有关具体规则规范，包含对具体规则规范进一步细化制定的相应实施细则（以下简称“规则规范”）；
        <br />
        3.根据火品平台临时性管理需求所发布的临时公告。
        <br />
      </div>
      <p>
        （二）【效力级别】《总则》中已有规定的，从其规定；规则规范或临时公告有特别规定的，从特别规定。火品平台规则尚无规定的，火品根据法律规定或相关协议处理。
      </p>
      <div className="fwb">第六条 【规则程序】</div>
      <p>
        火品根据国家法律规定要求和生态体系发展需要，对火品平台规则适时审慎制定或修改，并在火品平台规则页面进行公示，规则自公示期满之日起生效。
        制定或修改的交易规则依法适用专门的公开征求意见程序，并向相关职能部门报备。
      </p>
      <div className="fwb">第七条</div>
      <p>
        【规则溯及力】发生在规则生效以前的行为，适用当时的规则；发生在规则生效以后的行为，适用新规则。
      </p>
      <div className="fwb">第二章 会员一般规定</div>
      <div className="fwb">第八条 【通用原则】</div>
      <p>
        第会员在火品平台的所有行为都需要遵守国家法律规定、火品平台规则要求，以及根据火品平台相应页面指引进行操作。
      </p>
      <div className="fwb">第九条 【注册】</div>
      <p>
        会员应当根据火品平台的流程和要求完成注册，会员名注册后无法自行修改。会员账户如为不活跃账户等情形的，火品可进行回收。
      </p>
      <div className="fwb">第十条 【认证】</div>
      <p>
        会员应当根据火品平台的认证要求，提供会员本人（含自然人、法人及其负责人、非法人组织及其负责人等，下同）真实有效的信息。
        <br />
        （一）会员应当提供的信息包括但不限于：本人身份信息、有效联系方式、真实地址、支付宝相关信息等证明身份真实性、有效性、一致性的信息。会员提供的本人信息不完整、失效或可能不准确的，火品可不予通过认证。
        <br />
        （二）为保障会员认证信息的持续真实有效，火品可对已通过认证的会员信息进行复核。
        <br />
      </p>
      <div className="fwb">第十一条 【信息发布】</div>
      <p>
        会员不得发布如下信息：
        <br />
        （一）反对宪法所确定的基本原则的；
        <br />
        （二）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
        <br />
        （三）损害国家荣誉和利益的；
        <br />
        （四）歪曲、丑化、亵渎、否定英雄烈士事迹和精神，以侮辱、诽谤或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉的；
        <br />
        （五）宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动的；
        <br />
        （六）煽动民族仇恨、民族歧视，破坏民族团结的；
        <br />
        （七）破坏国家宗教政策，宣扬邪教和封建迷信的；
        <br />
        （八）散布谣言，扰乱经济秩序和社会秩序，破坏社会稳定的；
        <br />
        （九）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
        <br />
        （十）侮辱或者诽谤他人，侵害他人合法权益的；
        <br />
        （十一）欺诈、虚假、不准确或存在误导性的；
        <br />
        （十二）其他违反法律规定、社会公德或根据火品平台相关协议等不适合在火品平台上发布的。
        <br />
      </p>
      <div className="fwb">第十二条 【交易】</div>
      <p>
        会员应遵守火品平台交易流程的各项要求进行真实交易。会员因火品平台上的交易发生争议，可向火品发起争议调处服务请求，火品可视情况要求买卖双方提供相关证明材料，并根据《火品平台争议处理规则》处理。
      </p>
      <div className="fwb">第十三条 【评价】</div>
      <p>
        会员应合理使用火品平台评价工具，其中使用火品评价工具的须遵守《火品平台评价管理规则》等相关规定，使用火品平台其他评价工具的须遵守相关规则规定。
      </p>
      <div className="fwb">第三章 卖家规定</div>
      <div className="fwb">第十四条 【开店与退出】</div>
      <p>
        满足相关条件后，方可根据火品设置的流程创建店铺或变更店铺经营主体。正常情况下，一个会员作为卖家仅能开设一个店铺，具备一定持续经营能力、满足一定经营条件。
        店铺在一定期间内持续无出售中商品的，火品平台可以释放该店铺。
        卖家可通过火品设置的流程注销店铺，店铺注销前须对已达成的交易履行发货、退换货、维权投诉处理等交易保障义务。
      </p>
      <div className="fwb">第十五条 【资质备案】</div>
      <p>
        卖家发布需要准入的商品或服务信息时，应当根据相关规则及系统设置要求提交资质材料，通过火品网备案或审查。
      </p>
      <div className="fwb">第十六条 【信息及质量】</div>
      <p>
        卖家发布的商品或服务信息须符合《火品平台商品价格规范》、《火品平台商家信息发布管理规范》等相关规定。
        卖家应确保其出售的商品或服务在合理期限内可以正常使用，具备其应当具备的使用性能、符合包装说明上注明采用的标准等，不存在危及人身财产安全的风险，并对其所售商品或服务质量承担相应责任。
      </p>
      <div className="fwb">第十七条 【交易履约与服务保障】</div>
      <p>
        会员可根据火品网要求及实际需求选择交易方式。
        卖家须履行交易或服务等承诺,包括根据火品网规则及其自身作出的承诺在规定和承诺期限内及时发货（特殊情形除外）等。
        卖家应保障买家合法权益,提供消费者保障服务，遵守《火品平台七天无理由退货规范》等相关规定。
      </p>
      <div className="fwb">第十八条 【营销】</div>
      <p>卖家参加火品网营销活动须遵守《火品平台营销活动规则》或对应营销活动规则等相关规定。</p>
      <div className="fwb">第十九条 【行业与特色市场】</div>
      <p>特定行业或特色市场的火品网卖家须遵守《火品平台行业管理规范》、《火品平台招商标准》。</p>
      <div className="fwb">第四章 其他角色规定</div>
      <div className="fwb">第二十条【供货商】</div>
      <p>供应商应遵守《火品供货商管理制度》等相关规定。</p>
      <div className="fwb">第二十一条【城市服务商】</div>
      <p>城市服务商应遵守《火品城市服务商管理制度》等相关规定。</p>
      <div className="fwb">第二十二条【其他用户】</div>
      <p>
        为尽力满足用户需求，不断提升用户体验，火品平台可能会不时推出新的市场及服务，相应市场及服务的用户应遵守相应协议及火品平台规则页面公示并生效的相关规则等规定。
      </p>
      <div className="fwb">第五章 市场管理与违规处理</div>
      <div className="fwb">第二十三条</div>
      <p>
        火品平台会员的风险行为及违规行为根据《火品商家违规评分管理规则》处理，其他火品平台会员根据其平台相关规则处理。
      </p>
      <div className="fwb">第六章 附则</div>
      <div className="fwb">第二十四条</div>
      <p>本规则于2020年9月1日首次生效，于2020年9月10日最新修订。</p>
      <div className="fwb">第二十五条</div>
      <p>火品平台规则中的“以上”，包含本数；火品平台规则中的“以下”，不包含本数。</p>
      <div className="fwb">第二十六条</div>
      <p>火品平台规则中的“天”，以24小时计算。</p>
      <div className="fwb">附录定义</div>
      <div>
        1.用户，指火品平台各项服务的使用者。用户无需注册，即可浏览火品平台相关信息。 <br />
        2.会员，指与火品签订服务协议并完成注册流程的用户，包括平等民事主体的自然人、法人和非法人组织。
        <br />
        3.买家，指在火品平台上购买商品或服务的会员。
        <br />
        4.卖家，指在火品平台上成功创建店铺并从事商品销售或提供服务的经营活动的会员。
        <br />
        5.其他相关者，指与火品平台用户有一定关联关系的个体或组织，如知识产权权利人、供销平台用户、服务市场用户、内容创作者及机构等。
        <br />
        6.火品，火品平台经营者的单称或合称，包括火品平台经营者武汉垂定网络科技有限公司等。
        <br />
        7.知识产权权利人，指依法拥有商标权、著作权、专利权等知识产权的自然人、法人或其他组织。
        <br />
      </div>
    </div>
  );
};

export default Agreement;
