import React from 'react';

const Agreement = () => {
  return (
    <div>
      <p className="mb10">
        本合同由在火品平台依据《用户注册协议》登记注册，且符合火品精选平台商家入驻标准的自然人、法人或非法人组织（以下简称
        “商家”）与武汉垂定网络科技有限公司（以下简称 “火品”或“火品精选”）共同缔结。
      </p>
      <p className="mb10">
        友情提醒：在点击/签署本合同之前，请商家务必审慎阅读、充分理解本合同的全部内容，特别是以粗体标注的内容，商家应重点阅读。
      </p>
      <p className="mb10">
        如果商家对本合同的条款有疑问，请通过邮件渠道或火品公布的其他有效渠道询问火品工作人员，火品将向商家解释条款内容。如果商家不同意本合同的任何内容，或者无法准确理解条款的含义或火品对条款的解释，请不要进行后续操作。
      </p>
      <p className="mb10">
        一经商家点击“我已阅读并且同意以上服务协议”，即意味着商家同意与火品签订本协议并同意受本协议约束。
      </p>
      <p className="mb10">&nbsp;</p>
      <p className="mb10">一、定义</p>
      <p className="mb10">
        1.1“商家后台账户”是指商家经申请注册在火品获得的唯一账户（编号之间互不相同）和密码。商家在使用火品服务的过程中，必须使用账户配合其自设的密码登录，商家获得的账户账号和密码由商家自行保管。商家享有其账户及后台账户的使用权，并应妥善保管其账户及密码信息，未经火品事先书面同意，不得向他人转让或以出租、出借、授权使用等方式将其享有的火品账户账号、密码提供给他人使用。
      </p>
      <p className="mb10">
        1.2“入驻标准”指商家使用火品服务须满足的前提标准，商家需要满足火品平台要求的《火品招商入驻标准及资质要求》。火品有权不定时修订招商标准，并会在系统平台统一公示，并不定时对商家的符合情况进行检查核实。
      </p>
      <p className="mb10">二、合作模式</p>
      <p className="mb10">
        2.1本协议生效后，商家即入驻火品自营的服务型平台商城，进行商品或服务的在线交易，商家经营内容必须符合中华人民共和国法律规定。
      </p>
      <p className="mb10">
        2.1.1火品精选栏目中，商家仅对B端用户提供商品/服务，B端用户包括但不限于线下实体经营者、社区社群团长、自媒体创业者及拥有私域流量传播者；B端用户主要以拼团、直接下单等方式向商家购买商品/服务。
      </p>
      <p className="mb10">
        2.2商家自行负责商品信息、商品展示的设计和风格，商品信息、售价等内容应符合火品的商品上架规则。
      </p>
      <p className="mb10">
        2.3商家理解并确认，依据火品运营和营销活动要求，商家可自行报名选择不同活动类型，增加其商品/服务曝光率和成交率，活动展示为非固定模式，火品有权根据活动性质、内部排期确定商家商品展示位置和上线时间。
      </p>
      <p className="mb10">
        2.4商家自行负责火品系统处理订单、买家咨询和售后服务等事宜，按照火品平台的发货以及退换货等规则处理。
      </p>
      <p className="mb10">
        2.5商家同意按照火品平台保证金规则向商家缴纳及补足保证金。火品有权依据平台规则扣除、返还保证金。
      </p>
      <p className="mb10">
        2.6商家同意向火品支付交易服务费，即商家商品/服务在火品平台交易成功后按商家销售商品/服务订单的固定比例支付服务费给火品，具体商品/服务类目的服务费比例以火品最新公布的规则或双方约定为准，火品有权从商家每次结算货款中相应扣除。
      </p>
      <p className="mb10">
        商家可在支付交易服务费后，通过火品平台商家端申请开票（每月固定周期）。（可参照火品平台发票管理规则）。火品将在收到申请后向商家开具相应金额和对应类型的服务费发票。
      </p>
      <p className="mb10">
        2.7商家同意按照火品平台及商家入驻商城的结算及发货规则进行货款结算与发货。
      </p>
      <p className="mb10">2.8双方指定收款账户</p>
      <p className="mb10">2.8.1供货商按照系统指定火品账户（见后台保证金缴纳明细处）</p>
      <p className="mb10">
        2.8.2
        供货商的收款账户不得随意变更，如需变更，应提前十个工作日书面通知火品，并按火品要求提供相关证明材料；如供货商未通知火品或未提供材料，由此产生的所有后果由供货商承担。
      </p>
      <p className="mb10">三、火品权利与义务</p>
      <p className="mb10">
        3.1
        火品有义务在现有技术上维护火品平台的正常运行，使商家交易活动得以顺利进行，并按照结算规则向商家结算。
      </p>
      <p className="mb10">
        3.2
        火品负责火品平台的交易及订单数据维护，以备双方查询及对账，相关的信息及数据火品有权至少保存3年；及时处理系统故障，保障业务平台及交易系统的正常、有效运行。
      </p>
      <p className="mb10">
        3.3
        火品有权对商家提交的任何资料进行审核，如发现资料存在不合法的情形，火品有权要求商家修改。火品的审核只是形式审核，火品对商家提交资料及信息的审核均不代表本网站对审核内容的真实、合法、准确、完整性作出的确认，商家应对提供资料及信息承担相应的法律责任。如因商家推广材料导致火品损失，商家应承担全部法律责任，并且火品有权立即终止商家使用火品平台。
      </p>
      <p className="mb10">
        3.4
        经国家机关生效法律文书确认商家存在违法违规行为，或者火品有合理理由可以认定商家存在违反国家法律法规等的规定、本合同或火品平台相关规则行为的，火品有权根据在火品平台或其他火品授权渠道公布商家的前述相关行为及火品采取的相应处理措施。
      </p>
      <p className="mb10">
        3.5
        火品有权对商家商品进行样品检查和不定时抽检，有权决定在火品平台禁售经质量抽检证明为不合格的产品。关于抽检的方式、适用的检测标准和检测结果的认定以国家相关法律法规、国家及行业标准、火品平台公布的各商品类目的品质抽检行为规则等要求为准。
      </p>
      <p className="mb10">四、商家的权利与义务</p>
      <p className="mb10">
        4.1商家在此承诺并确认，其拥有合法的权利能力和行为能力缔结本合同并使用火品相关服务，保证向火品提供真实、合法、准确、有效的信息和资料，并保证包括但不限于电子邮件地址、联系电话、联系地址、公司银行账号等内容的有效性及安全性，保证火品及其他用户可以通过上述联系方式与商家进行联系。同时，商家有义务在相关资料发生变更时及时更新有关信息和资料。
      </p>
      <p className="mb10">
        商家应按照《火品账户使用规则》妥善保管登录火品平台的账户、密码等信息，指定专人操作商家系统。
      </p>
      <p className="mb10">
        4.2商家在此承诺并确认其遵守国家法律法规等的规定、本合同约定以及火品平台相关规则。任何通过商家火品后台账户进行的操作、行为或承诺均视为商家行为或已获得商家充分的授权，商家应对该等操作、行为或承诺承担全部责任。
      </p>
      <p className="mb10">
        4.3
        商家在此承诺并确认，其发布于火品平台的所有信息（包括但不限于商品图片、字体、模特肖像、商标、文案等）真实、准确、合法、有效，符合相关法律法规等的规定、本合同和火品平台相关规则的要求，不侵犯任何第三方的合法权益。
      </p>
      <p className="mb10">
        4.4商家在此理解并确认，商家对其所售商品/服务质量承担保证责任是商家的基本义务。商家提供的商品或服务应符合国家法律法规及火品平台规则。
      </p>
      <p className="mb10">
        4.5商家应按照国家法律法规及火品平台规则对其提供的商品或服务进行售后处理。
      </p>
      <p className="mb10">
        4.6商家承诺并保证，其在使用火品服务进行交易的过程中遵守诚实信用的原则，不在交易过程中采取不正当竞争行为，不扰乱火品交易的正常秩序，不在火品平台从事与网上交易无关的行为。
      </p>
      <p className="mb10">
        4.7
        商家应保证其在火品平台销售的商品/服务及发布的全部信息等内容不侵犯任何第三方的合法权利或者已获得权利人合法授权，包括但不限于商标权、专利权、著作权、企业字号、商业秘密等；商家亦在此承诺并保证火品及其代表免于任何形式的侵权索赔或赔偿；若发生该知识产权侵权指控，商家应立即采取补救措施以使火品能合法继续使用该项知识产权且不构成侵权（由此产生的相关投诉，火品不承担相关责任，由商家采取相关措施）
      </p>
      <p className="mb10">
        商家同意，将其在火品平台上发布的全部内容（包括但不限于已发布及未来可能发布的商品商标、logo、作品、订单信息、成交额等）授予火品全球范围内免费的、不可撤销的、非独家的、可转授权的许可使用，火品有权以推广商家、相关商品和/或相关品牌或火品平台等为目的，全部或部分地使用、复制、修改、改编、发布、翻译、分发和展示商家前述内容，和/或将此等内容编入当前已知的或以后开发的其他任何形式的作品、读物、期刊、报道或技术中。
      </p>
      <p className="mb10">
        4.8商家理解并同意商家或消费者在使用火品平台过程中可能出现延误、错误、故障等情况，火品不因此而承担责任。
      </p>
      <p className="mb10">
        4.9如遇行政部门、司法部门等监管部门或火品平台抽检要求商家召回商品或出现批量事故（订单退货率超过20%以上）等，商家对其销售的商品/服务应当：a.停止接受订单和发货；b.立即召回所有已发货产品；c.配合火品和监管部门妥善处理；d.承担相关赔偿责任。
      </p>
      <p className="mb10">
        4.10商家应采取技术措施和其他必要措施妥善保管消费者信息（包括但不限于用户姓名、收件地址、电话、订单等），防止泄露。未经B端用户及火品平台允许，不得泄露、篡改、毁损，不得出售或者非法向他人提供消费者信息；如商家违反前述要求，每发现一次商家应向火品支付人民币200,000元（大写：贰拾万元整）作为违约金，违约金不足以赔偿火品损失的，火品有权继续追偿，同时，商家应向消费者承担损害赔偿责任。
      </p>
      <p className="mb10">
        4.11依法纳税是每一个公民、企业应尽的义务，商家应依法及时、足额地向其所在地主管税务机关申报纳税。
      </p>
      <p className="mb10">
        4.12未经火品或相关权利人书面许可，商家不得以任何形式非法地全部或部分复制、转载、引用、链接、抓取、反向工程、反向编译、反汇编或以其他方式使用火品服务中包含的任何文本、图片、图形、音频和/或视频资料等信息内容，否则，火品或相关权利人有权追究其法律责任。
      </p>
      <p className="mb10">五、服务的开通和期限</p>
      <p className="mb10">5.1火品服务将在以下条件均满足后开通：</p>
      <p className="mb10">5.1.1商家向火品提交的信息经火品审核通过；</p>
      <p className="mb10">5.1.2商家符合其申请使用火品服务时的《火品商家入驻标准》；</p>
      <p className="mb10">5.1.3商家或其委托代理人与火品以在线点击确认/签署的方式签订本合同；</p>
      <p className="mb10">5.1.4商家保证金已被成功缴纳至火品指定账户内；</p>
      <p className="mb10">
        5.2服务期为一年，自商家后台账户开通之日起计算，服务期届满后，商家按照火品平台相关规则申请续签。
      </p>
      <p className="mb10">5.3合同的终止</p>
      <p className="mb10">
        5.3.1自然终止：本合同履行期限与服务期一致，服务期届满双方未续约的，则本合同将在履行期限届满时终止。
      </p>
      <p className="mb10">
        5.3.2商家在火品出现以下情形，火品有权单方面终止本协议并将商家清退出火品平台：
      </p>
      <p className="mb10">（1）火品多次收到用户投诉的；</p>
      <p className="mb10">
        （2）侵害他人名誉权、隐私权、商业秘密、商标权、著作权、专利权等合法权益；
      </p>
      <p className="mb10">（3）违反依法定或约定之保密义务；</p>
      <p className="mb10">
        （4）从事不法交易行为，如洗钱、贩卖枪支、毒品、禁药、盗版软件、黄色淫秽物品、及其他火品认为不得使用本服务进行交易的物品等；
      </p>
      <p className="mb10">（5）提供赌博资讯或以任何方式引诱他人参与赌博；</p>
      <p className="mb10">
        （6）非法使用他人银行账户（包括信用卡账户）或无效银行账号（包括信用卡账户）交易；
      </p>
      <p className="mb10">
        （7）违反《银行卡业务管理办法》使用银行卡，或利用信用卡套取现金（以下简称套现）；
      </p>
      <p className="mb10">（8）进行与你或交易对方宣称的交易内容不符的交易，或不真实的交易；</p>
      <p className="mb10">（9）从事任何可能含有电脑病毒或是可能侵害本服务系统、资料之行为；</p>
      <p className="mb10">
        （10）含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的；
      </p>
      <p className="mb10">
        （11）你通过火品平台获取他人信息，骚扰火品商户或合作伙伴，或骗取火品商户或合作伙伴的金钱的；
      </p>
      <p className="mb10">
        （12）违反本协议约定或《火品供应商管理规则》等内容，依照规定火品有权终止向商家提供服务的；
      </p>
      <p className="mb10">（13）其他火品有正当理由认为不适当之行为。</p>
      <p className="mb10">5.4合同终止后有关事项的处理：</p>
      <p className="mb10">
        5.4.1合同终止后，火品没有义务为商家保留商家后台账户或与之相关的任何信息，或转发任何未曾阅读或发送的信息给商家或第三方，也不就终止合同而对商家或任何第三方承担任何责任；
      </p>
      <p className="mb10">
        5.4.2无论本合同因何原因终止，在合同终止前因商家行为所导致的任何赔偿和责任，商家必须完全且独立地承担；
      </p>
      <p className="mb10">
        5.4.3合同终止后，火品有权保留商家的注册数据及以前的交易行为记录及相关日志信息。如商家在本合同终止前在火品平台上存在违反国家法律法规等规定的行为或违反本合同、火品平台相关规则的行为，火品仍可行使本合同所规定的权利。
      </p>
      <p className="mb10">
        5.4.4商家应当至迟在合同终止后两个月内处理完毕所有未完结的交易、待结款项及任何投诉、举报、处罚或纠纷（包括但不限于与火品、消费者或其他第三方的争议或纠纷）。
      </p>
      <p className="mb10">&nbsp;</p>
      <p className="mb10">六、商业秘密</p>
      <p className="mb10">
        6.1一方或其雇员因签订或履行本合同而了解或获得的对方的有关信息，包括且不限于有关技术、财务、市场、管理、销售数据等方面的内部信息，均为对方的保密信息，应为对方的专有财产。
      </p>
      <p className="mb10">
        6.2双方相互承诺对对方的保密信息严格保密，且仅用于本合同之约定目的，除下列情况外不得使用或允许他人使用对方的保密信息，或向任何第三方披露对方的保密信息：
      </p>
      <p className="mb10">a.经另一方事先书面同意；</p>
      <p className="mb10">
        b.按照有管辖权的法院、任何政府部门、司法机关、证券交易所或其他监管机构的命令或要求。
      </p>
      <p className="mb10">6.3无论本合同是否终止/解除，本保密条款均长期具有法律效力。</p>
      <p className="mb10">&nbsp;</p>
      <p className="mb10">七、声明与保证</p>
      <p className="mb10">7.1双方互相向对方声明、陈述和保证如下：</p>
      <p className="mb10">
        7.1.1其是合法设立并有效存续的独立法律实体，或具备中华人民共和国法律法规规定的拥有完全民事行为能力的自然人；
      </p>
      <p className="mb10">7.1.2其有资格从事本合同项下之合作，而该合作符合其经营范围之规定；</p>
      <p className="mb10">7.1.3其委托代理人已获得充分授权可代表其签署本合同；</p>
      <p className="mb10">
        7.1.4其有能力履行其于本合同项下之义务；并且该等履行义务的行为不违反任何对其有约束力的法律文件的限制。
      </p>
      <p className="mb10">
        7.2商家保证其有合法的营业执照、组织机构代码证、税务登记证、开户银行等资质性文件；
      </p>
      <p className="mb10">
        商家亦保证：a.拥有自有品牌且已获准中国商标注册或开始申请；或b.有合法渠道获得商品并被授权可以使用该商品的商标、标识等用于销售、推广。
      </p>
      <p className="mb10">
        7.3根据商品类型不同，商家亦保证提供相应的授权性文件或行政许可，包括但不限于生产许可证、食品经营许可证、商标授权许可证明、3C强制证书等。
      </p>
      <p className="mb10">7.4商家对其提供的以下文件、证明性资料的真实性、合法性负责：</p>
      <p className="mb10">
        7.4.1商家欲使用火品服务，必须根据火品要求提交其在申请服务时应当提供的证明文件或其他相关证明；
      </p>
      <p className="mb10">
        7.4.2合同期内，上述相关证明文件的任何变更商家都应及时通知火品，如上述证明文件变更后导致商家无法进行正常活动排期、货款提现、保证金退回等操作的，商家应及时书面通知火品并提供相应证明性文件；
      </p>
      <p className="mb10">
        7.4.3商家同意为其未及时的通知或更新其证明文件或其他证明信息承担全部责任，商家保证其向火品提供的全部证明文件真实、准确且不存在超过时效问题（即保证所有证明文件在整个合同履行期间都处于有效期内），如因上述原因发生纠纷或被相关国家主管机关处罚，商家应当独立承担全部责任，如给火品造成损失的，商家同意赔偿全部损失。
      </p>
      <p className="mb10">
        7.5甲乙双方的关系都是独立自主、自负盈亏的合法经营者，仅存在受本合同约束而形成的入驻关系。甲乙双方不存在民事委托代理、隶属、投资、雇佣、承包等关系，双方雇佣的员工不属于对方的员工，相互间对其劳资关系及行为不承担任何责任，经营中形成的债权、债务，各自承担相应的法律责任和义务。
      </p>
      <p className="mb10">八、责任限制</p>
      <p className="mb10">
        8.1火品按“现状”和“可得到”的状态提供服务。商家在开通火品服务前已充分了解火品平台的功能和服务特性，且同意火品无须就已存在的软件瑕疵、功能不足或任何需改进事项对商家承担责任。
      </p>
      <p className="mb10">
        8.2火品仅对因其故意导致的商家损失承担违约和/或赔偿责任，且金额以商家已向火品支付的服务费用为限。
      </p>
      <p className="mb10">
        8.3不论在何种情况下，火品均不对由于互联网连接故障、计算机系统故障、通讯故障、电力故障、电脑病毒、黑客入侵、罢工、劳动争议、火灾、洪水、风暴、爆炸、战争、政府行为、司法行政命令等不可抗力因素而造成的不能服务或延迟服务承担责任。
      </p>
      <p className="mb10">
        8.4火品仅作为为商家提供商品/服务交易信息的平台。本协议的签署并不意味着火品对商家行为的合法性、有效性及商品的真实性、合法性和有效性作任何明示或暗示的担保。
      </p>
      <p className="mb10">
        8.5在使用火品服务的过程中，商家不可撤销地授权和接受火品在交易过程中出现的售后争议责任判定，并对火品确定的责任归属和责任金额不持异议，如最终证明火品判责有误或赔付金额过高，商家同意自行向受益的消费者进行追偿，不向火品追责或主张任何权利。
      </p>
      <p className="mb10">&nbsp;</p>
      <p className="mb10">九、违约责任</p>
      <p className="mb10">9.1甲乙双方应正当行使权利，履行义务，保证本协议的顺利履行。</p>
      <p className="mb10">
        9.2任何一方没有充分、及时履行义务的，应当承担违约责任；给对方造成损失的，应赔偿对方由此所遭受的所有损失，本协议另有约定的除外。
      </p>
      <p className="mb10">
        9.3
        若商家在火品或关联方店铺被投诉或经核实或火品经合理判断认为商家存在违反国家法律法规等的规定、本协议或火品平台相关规则的情形，包括但不限于销售侵权商品、假冒伪劣、以旧换新、掺假卖假、虚假宣传、提供的图片或文字信息侵犯他人知识产权、产生批量事故商品、提供非法服务等，或者商家发布的信息是与网上交易无关或不是以交易为目的的信息，或商家存在其他违反公共利益或可能侵害火品和/或其他第三方合法权益的行为，商家理解并同意火品有权视情节轻重采取以下一项或多项措施：
      </p>
      <p className="mb10">9.3.1对商家发布的信息采取删除、屏蔽、断开链接等措施；</p>
      <p className="mb10">9.3.2中止提供服务或终止本协议；</p>
      <p className="mb10">9.3.3扣除商家部分或全部保证金；</p>
      <p className="mb10">
        9.3.4要求商家支付违约金，违约金金额为商家在火品平台已销售商品销售总价的20%；
      </p>
      <p className="mb10">
        9.3.5限制商家后台账户的操作权限或采取冻结、屏蔽、关闭商家后台账户等措施；
      </p>
      <p className="mb10">9.3.6冻结商家在火品平台的全部或部分资金、货物；</p>
      <p className="mb10">
        9.3.7要求商家赔偿火品的所有损失，包括但不限于火品对消费者的赔偿、行政部门的扣款、商品召回支出、鉴定费、律师费、合理人工差旅支出等；
      </p>
      <p className="mb10">9.3.8按照司法机关或政府机关等监管部门的要求提交商家的相关资料及信息。</p>
      <p className="mb10">
        若因商家商品导致消费者人身及财产损失等，除火品有权对商家采取上述措施外，商家还应向火品支付人民币500,000元（大写：伍拾万元整）作为商家的违约行为导致火品商誉损失的违约金。
      </p>
      <p className="mb10">
        9.4商家保证提供给火品的资质性文件、证明性文件等真实有效，若商家提供的上述资料不全、虚假、无效、失效等，一经查实，火品有权立即解除协议，并要求商家向火品支付人民币100,000元（大写：壹拾万元整）作为违约金。
      </p>
      <p className="mb10">
        9.5反商业贿赂：商业贿赂是指商家及其工作人员为获取火品的合作及利益，主动或被动向火品工作人员或家属等提供的一切物质上的馈赠，包括但不限于回扣、礼物、娱乐活动等。商家及其员工向火品及其员工等进行商业贿赂的，一经发现，无论是否造成火品实际损害结果，火品均有权采取下列措施：立即解除双方合同、终止合作，并要求商家向火品支付相当于商家在火品平台已销售商品销售总价的30%的违约金。如火品人员违反上述约定私下向商家工作人员索贿或商家或其工作人员遭遇火品工作人员刁难，商家应拒绝，并鼓励商家向火品举报。
      </p>
      <p className="mb10">举报电话：027-82882696&nbsp; &nbsp; &nbsp; &nbsp;&nbsp; 邮箱：</p>
      <p className="mb10">9.6 火品平台相关规则另有规定的，按照规定执行。</p>
      <p className="mb10">十、不可抗力</p>
      <p className="mb10">
        10.1“不可抗力”是指合同双方不能合理控制、不可预见且无法避免的事件，该事件妨碍、影响或延误任何一方根据合同履行其全部或部分义务。该事件包括但不限于政府行为、自然灾害、战争或任何其它类似事件。
      </p>
      <p className="mb10">
        10.2出现不可抗力事件时，受不可抗力影响方应及时向对方以书面形式发通知，并告知对方该类事件对本合同可能产生的影响，并应当在合理期限内提供相关证明。
      </p>
      <p className="mb10">
        10.3由于以上所述不可抗力事件致使合同的部分或全部不能履行或延迟履行，则双方于彼此间不承担任何违约责任。
      </p>
      <p className="mb10">十一、完整性与可分性</p>
      <p className="mb10">
        11.1
        本合同构成双方对本合同之约定事项及其他有关事宜的完整合同，并取代双方在签署本合同之前就该事项所达成的所有合同、备忘录等。
      </p>
      <p className="mb10">
        11.2
        本合同无效、被撤销或者终止的，不影响本合同中独立存在的有关解决争议方法与法律适用等条款的效力。
      </p>
      <p className="mb10">十二、争议解决与法律适用</p>
      <p className="mb10">
        12.1如双方就本合同内容或其执行发生争议，双方应友好协商；若经协商仍无法解决争议，则双方应将争议提交火品住所地有管辖权的人民法院诉讼解决。
      </p>
      <p className="mb10">12.2本合同的订立、履行、解释及争议解决均适用中华人民共和国法律。</p>
    </div>
  );
};

export default Agreement;
